app/Models/Persona.php

    public function todasLasPersonas(){
        $personas = $this->db->table('personas');
        $resultado = $personas->get();
---
SELECT *
FROM `personas`

    public function personaPorNombre(string $buscar){
        $tabla = $this->db->table("personas");
        $tabla->like("nombre",$buscar,"both");
        $tabla->orLike("apellidos",$buscar);
        $resultado = $tabla->get();
---
SELECT *
FROM `personas`
WHERE `nombre` LIKE '%ma%' ESCAPE '!'