app/Models/Persona.php

INSERT INTO `personas` (`id_persona`, `nombre`, `apellidos`, `email`, `edad`, `fecha_nacimiento`, `create_by`, `create_to`, `delete_by`, `delete_to`, `borrado_logico`, `informacion`, `imagen`, `id_rol`) VALUES (NULL, 'Facundo', 'Lima Valle', 'facundolima@gmail.com', 17, '2007-07-10', '2024-01-27 00:10:36', '1', NULL, NULL, 0, 'mi hermano', NULL, '1')
---
    public function nuevaPersona($nombre,$apellido,$email,$fecha,$rol,$informacion){
        $datosDePersona = $this->db->table('personas');
        $fechaActual = date('Y-m-d H:i:s');
        $añoAhora = date('Y');
        $fechaObjeto = date_create($fecha);
        $fechaCambioFormato = date_format($fechaObjeto,'Y');
        $edadPersona = (int)$añoAhora - (int) $fechaCambioFormato;
        $idSession = $this->session->get('id');
        $datosDeNuevaPersona = [
            'id_persona'=>null,
            'nombre'=>$nombre,
            'apellidos'=>$apellido,
            'email'=>$email,
            'edad'=>$edadPersona,
            'fecha_nacimiento'=>$fecha,
            'create_by'=>$fechaActual,
            'create_to'=>$idSession,
            'delete_by'=>null,
            'delete_to'=>null,
            'borrado_logico'=>0,
            'informacion'=>$informacion,
            'imagen'=>null,
            'id_rol'=>$rol,
        ];
        $datosDePersona->insert($datosDeNuevaPersona);