app/Models/Rol.php

    public function rolesPorID($id){
        $tablaRoles = $this->db->table('rol');
        $tablaRoles->where('id_rol',$id);
        $resultadosRoles = $tablaRoles->get();
---
SELECT *
FROM `rol`
WHERE `id_rol` = '3'