app/Models/Usuario.php

SELECT *
FROM `usuario`
WHERE `username` = 'mlimavalle'
---
    public function buscarNombreDeusuario($nombre,$password){
        if($this->confirmarPassword($nombre,$password)){
            $tabla = $this->db->table('usuario');
            $tabla->where('username',$nombre);
            $resultadoDeBusqueda = $tabla->get();

SELECT `password`
FROM `usuario`
WHERE `username` = 'mlimavalle'
---
    public function confirmarPassword($usuario,$password){
        $tabla = $this->db->table('usuario');
        $tabla->select('password');
        $tabla->where('username',$usuario);
        $resultado = $tabla->get()->getRow();